laRhea BL
                          laRhea BL
Prędk. Miesz.             laRhea V+
                          ustaw
kubek                         włączanie...
proszę czekać          wst. wybór
-   Cukier   +           ustaw
kubek                         wyciągnij kubek
Proszę              przygotowanie
napoju nr   §1        §1
przygotowanie                    wprowadź
dokładną kwotę             sprawdź ekspres
do kawy             Programowanie
OK                    Błąd podczas
programowania          1= PRZ.---> VMC
2= VMC ---> PRZ.    Programowanie
Dane EPROM            Programowanie---
RHEA FLASH------   Rezerwa produktu
§1                 FILTR WODY
CZYSZCZ.10=START         maszyna
gotowa                      Serwis
Karta                        Niedostępny
                        reset kawy
fusy=RESET               reset kawy
fusy = P1                 
                                  Kredyt:
§1                          Nie działa
filtr wody               serwis
wyczyść ekspres              cena :     §1
                      Nie działa
fusy kawy                brak produktu
                      uzupeł. wody
czekaj                 czekaj
                             czekaj
temperatura                  Nieczynny
OFF §1 §2                 maszyna wył.
§1:§2                  ................
pocz. o:   §1:§2   TEST SPRZ.
                         podaruj sobie
chwilę relaksu        Świeże
Mleko                        komunikat 3
programowalny           miłej przerwy
                      Zawsze
do Twoich usług              wprow. monety
                      t. rozp.     §1
----------------    t.z §1  t.r §2
t.g §3               Czytnik karty
Niepodłączony         DATA AUDYTU
PROSZĘ CZEKAĆ           D Z B A N E K
                      sprzedawcyrhea
                     ustaw
kubek                         brak wyboru
S.Mleko  WYŁ §1         HAPPY
HOUR                          WOLNA SPRZ.
§1                      brak ziaren kawy
WYŁ §1             kom 48
                             Nie działa
brak wody                uzupeł. wodę i
naciś.przyc. -1-     Hydrodynamic
Emptying phase         automatyczny
brak pary              SERWIS
                             błąd na KLAW .
kod  §1              1-4=Mix 5=MilkMd
7=Gr 8=BC 9=Desc   1-4=płukanie
7=Gr 8=BC 9=Desc       1-4=Rinse 5=Milk
7=grinder 8=BC     1-4=Rinse
8=BC                      1-4=płukanie
                       płukanie  §1
§2                     karta czyt. RFID
podłączona         Cześć      §1
§2-§3-§4 §5 §6:§7     Wprowadź dokład.
kwotę              wymień
filtr wody                   wyczyść
ekspres                     opróżnij
fusy kawy                  UST. PRODUKT
---- OK ----           INSTALACJA
                         koniec
instalacji                   kredyt = 0
                         włóż
kartę                          KARTA WYBORU
                       Rezerwa produktu
UZUPEŁNIJ KAWĘ     Niedostępny
§1                      -  C U K I E R +
                   dokonaj
wyboru                      moduł drzwi
wers. §1                moduł espresso
wers. §1             moduł Mleka
wersja     §1           Periodic rinse
in §1 seconds         
OFF §1  §2                        Wyciągnij kubek
Proszę              czekaj ładowanie
bojler             nierozp. klient
kod karty           nierozp. maszyna
kod karty          szczęśliwy
wybór                    ŻETON
                              proszę czekać
temperat. pary        Cena  :    §1
Kredyt: §2            First coffee
in progress            opróżnianie
fusów kawy              wyciągnij
tackę ociekową            włóż
tackę ociekową                 płukanie parą
10=START              wlej detergent
10=START             filling water...
conduc.=§1 uS      wlej wodę
10=START                  ciepła woda
płuk.   10=START        Moduł Mleka
włączanie...            Pojem. na mleko
pusty               S T O P
                            Karta RFID
Zablokowana              Moduł Mleka
Proszę wyczyścić        wyczyść z
deterg. 10=START          Test cykliczny
zaokr #§1            Test cykliczny
Zatrzymany!!         wypłucz zimną
wodą    10=START      END Cleaning
with Detergent         KONIEC
płukania parą                czekaj czyszcz.
modułu mleka        Ustaw Kubek
proszę                  ustaw. młynka
Proszę czekać         §1
GORĄCA WODA                      Ogrzew. produktu
niski poziom        
                                  Weź kawę
Naciś. prz. PROG            
autom. reset                      Koniec
odinstaluj                   Wynik końc.: §1
KLAW. NAC.<PROG>    Czas czyszczenia
Mleko zaktualiz.   TEST W TOKU
                        potwierdź częśc.
reset  naciś P10   Początek testu
4=start PROG=kon     TEST SILN. - §1
lw §2  pr §3        TEST - §1  Tp: §2
gór§3  dół§4      Wynik końcowy
TEST - §1             System halted
Please restart!       Empty the waste
liquid tank         Insert the waste
liquid tank        rinsing §1   §2
........uS=§3       Have you done
checks?>START/10      Clean.Deter.type
10=Tab 12=Liquid   check milk
                         Check Detergent
of the water mix    Milk Mod.Clean.:
check deter. §1    Cleaning §1  §2
........uS=§3       Dissolving
Detergent §1 §2          Insert the milk
tube.10:now 9:no    Ins. Tube/refill
Milk 10:now 9:no   check milk
presence                 check milk
quality                  check milk and
make cleaning        Gest. rhMM1.v+ ?
B1=Enable B2=no    Clean. rhMM1.v+
Time §1:§2 Ok=P1    Milk Mod.Clean.:
low deterg. §1     check tank cold
milk temperature    Available
                          Close  Coffee
KEY PRESS <PROG>      Open   Coffee
KEY PRESS <PROG>      1/13 Clean Grin.
1=Grin1; 2=Grin2   2/13 G§1 Close
shutter.  10=ok      3/13 Rem. brewer
& bean hop 10=ok   4/13 Inst. clean
device.    10=ok   5/13 Grinder
clean   10=start       Cycle §1 of §2
                     6/13 Rep. Clean
10=Yes; other=NO    7/13 Ref. Clean
device.    10=ok    8/13 Put back
bean hop.  10=ok      9/13 Open hopp.
shutter.  10=ok     10/13 Coffee
grind.  10=Start       Cycle §1 of §2
timeout §3 sec       11/13 Rep. Proc.
10=Yes; other=NO   12/13 Put back
Brewer.  10 = ok     13/13 Coffee?
10=Yes; other=NO      ESPRESSO
preparing                  Forthcoming
sched maintenan.        Maintenance must
be performed       Enter Weight
1 = Save  §1           wyciągnij kubek
Proszę              Nie działa
brak wody                Place your cup
and close flap       wyciągnij
tackę ociekową            włóż
tackę ociekową                 Please close the
flap               Moduł Mleka
Proszę wyczyścić        ustaw
kubek                         wprowadź
dokładną kwotę             sprawdź ekspres
do kawy             serwis
wyczyść ekspres              ................
pocz. o:   §1:§2   TEST SPRZ.
                         podaruj sobie
chwilę relaksu        Świeże
Mleko                        komunikat 3
programowalny           miłej przerwy
                      Zawsze
do Twoich usług              wprow. monety
                      wyczyść
ekspres                     opróżnij
fusy kawy                  KONIEC prog.
prosze czekac...       access code
INHIBITED               Deinstalacja
w toku                  
                                  Kalibracja
niemozliwa               Zdemontuj zaparz
p.PROG = dalej     Zamontuj zaparz.
p.PROG = dalej     Otworz zawor
spust. 10=start        nacisnij p.PROG
                    koniec deinstal.
zamknij zawor      Przygotuj do
instal. 10=start       Tacka ociekowa
na poz.?10=start     Tacka ociekowa
na poz.?10=start     Oproznij pojem.
na fusy 10=start    Tacka ociekowa
pusta?  10=start     REJESTRACJA
USTEREK                 REJESTRACJA
USTEREK                 REJESTRACJA-----
-USTEREK--------   Przedwybor
nieuzywany               Produkt  §1
0=niedost.§2.§3         Czas mielenia §1
§2.§3              Czas mielenia
§1.§2                 Wprowadz wage gr
p.1=zapisz: §1     Ent. ML of water
1=Save 2=rep §1    Empties test jug
Test:  1=ok 2=no   Fill H2O FM tank
t.tube 1=ok 2=no   Confirm Action
10=YES      9=NO     1-4=Mix 5=MilkMd
8=BC 9=Desc        1-4=płukanie
8=BC 9=Desc            1-4=Rinse 5=Milk
8=BC               1-4=Rinse
7=grinder 8=BC            1-4=Mx M:5=C 6=D
7=Gr 8=BC 9=Desc   1-4=Mix 5=MilkMd
6=DeM 8=BC 9=Des   1-4=Mix 5=MilkMd
6=D.M 7=Gr. 8=BC   1-4=Mix 5=MilkMd
6=Desc.Milk 8=BC   OSZCZĘD. ENERGII
                   Kredyt:
karta kredytowa             Przedstawić
kartę                   Kalibr. młynka
wymagana             Refill   cups
                      Use own cups
                       